In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [3]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
# get the unique values of the dataframe
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [5]:
# get the non unique values of the dataframe
df['col1'].nunique()

4

In [6]:
# get the number of occurrences per data
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [7]:
# Col 1 > 2
# Col 2 = 444

new_df = df[(df['col2']==444) & (df['col1'] > 2)]

In [8]:
new_df

   col1  col2 col3
3     4   444  xyz

In [9]:
def times_two(number):
    return number*2

In [10]:
# add a new column as result of applying a function
df['new'] = df['col1'].apply(times_two)

In [11]:
df

   col1  col2 col3  new
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

In [12]:
# drop a column
del df['new']

In [13]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [14]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [15]:
# sorting by
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [16]:
# sorting by
df.sort_values('col2', ascending=False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

In [17]:
df = pd.read_csv('bank.csv')

In [18]:
df.tail()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

In [19]:
df['age'].mean()

41.17009511170095

In [20]:
# search by index
# what is the marital status of the youngest person in the dataset?
index_youngest = df['age'].idxmin()
df.iloc[index_youngest]['marital']

'single'

In [21]:
# return the number of unique values of a column
# how many unique job categories are there?
df['job'].nunique()

12

In [22]:
# how many people are there per job category?
df['job'].value_counts()

job
management       969
blue-collar      946
technician       768
admin.           478
services         417
retired          230
self-employed    183
entrepreneur     168
unemployed       128
housemaid        112
student           84
unknown           38
Name: count, dtype: int64

In [23]:
df['marital'].value_counts()

marital
married     2797
single      1196
divorced     528
Name: count, dtype: int64

In [24]:
# what percent of people in the dataset were married?
a = df['marital'].value_counts()['married']
b = len(df)
per = (a / b)*100
print(per)

61.86684361866843

In [25]:
# using .map method of df create a new column called "default code" which contains a 0 if there was no default, or 1 if there was a default.
def my_func(x):
    if x == 'yes':
        return 1
    if x == 'no':
        return 0


df['default_code'] = df['default'].map(my_func)
df.tail()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,default_code
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no,0
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no,1
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no,0
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no,0
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no,0

In [37]:
# using pandas .apply() method, create a new column called "marital_code". This column will only contain a shortened code of the possible marital status first letter. (For example "m" for "married", "s" for "single" etc.)

def first_letter_extract(x):
    first_letter = str(x[0]).capitalize()
    return first_letter

df['marital_code'] = df['marital'].apply(first_letter_extract)

In [38]:
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,default_code,marital_code
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no,0,M
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no,0,M
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no,0,S
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no,0,M
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no,0,M

In [39]:
# what was the longest lasting duration?
df['duration'].max()

3025

In [40]:
# what is the most common education level for people who are unemployed?
df[df['job']=='unemployed']['education'].value_counts()

education
secondary    68
tertiary     32
primary      26
unknown       2
Name: count, dtype: int64

In [41]:
# what is the average (mean) age for being unemployed?
df[df['job']=='unemployed']['age'].mean(numeric_only=True)

40.90625